// pages/home/home.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        userInfo:[
            {
                id:1,
                title:'品质保障',
                desc:'本店所售产品均为绿色健康农作物，在淘宝平台销售，绝对正品，凡在本店所购买的商品均提供售后服务。'
            },{
                id:2,
                title:'关于色差',
                desc:'所有商品均为实物拍摄，由于灯光及显示器色彩偏差可能导致图片存在色差，请以实物为准。'
            },{
                id:3,
                title:'关于配送',
                desc:'亲，您的订单将会在24小时内发出（活动期间及法定节假日除外)，本店每天下午发货（当天上午下单下午发货，当日上午11：00以后下单次日发货)。'
            },{
                id:4,
                title:'售后服务',
                desc:'由于本店销售产品为新鲜农作物，出现坏果坏菜本店予以赔偿或补发。若是出现天灾造成毁坏或出现订单拒签恶意延误签收时间导致生鲜毁坏腐烂的人为破坏行为本店拒绝赔偿。'
            }
        ]
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad(options) {

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady() {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow() {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide() {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload() {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh() {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom() {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage() {

    }
})